/*
    Author: Gotsinas Antonios

    Περιγραφή:

        Αρχείο που περιέχει συναρτήσεις υπολογισμού του νόμου του Ωμ.
        Οι συναρτήσεις αυτές θα χρησιμοποιηθούν στην κατασκευή ενός υπολογιστή
        σε μορφή ιστοσελίδας όπου ο χρήστης μπορεί να εισαγάγει τιμές σε πεδία εισόδου
        και να υπολογίζει το νόμο του Ωμ ανάλογα με τις γνωστές παραμέτρους που έχει στη διάθεσή του.
*/
// συνάρτηση υπολογισμού του ρεύματος με γνωστά την αντίσταση και την τάση
function Ohms_I(R,V,units) {
    // δήλωσε μία μεταβλητή που θα κρατά το ρεύμα και αρχικοποίησέ τη σε 0
    let I = 0;
    // στην περίπτωση που η παράμετρος R δεν είναι 0 τότε
    if (R != 0)
        I = V/R;    // υπολόγισε την τιμή του ρεύματος

    // άν πρέπει να εμφανίσουμε μονάδες μέτρησης στο αποτέλεσμα
    if (units == true)
        I = I + " Α";   // μορφοποίησε το αποτέλεσμα σε μορφή συμβολοσειράς με μονάδα μέτρησης

    return I;       // επέστρεψε την τιμή του ρεύματος
}        
// συνάρτηση υπολογισμού της τάσης με γνωστά την αντίσταση και το ρεύμα
function Ohms_V(R,I,units) {

    // δήλωσε μια μεταβλητή που θα κρατά το αποτέλεσμα
    let V = R * I;   // υπολόγισε το αποτέλεσμα της τάσης

    // άν πρέπει να εμφανίσουμε μονάδες μέτρησης στο αποτέλεσμα 
    if (units == true)
        V = V + " V"; // μορφοποίησε το αποτέλεσμα σε μορφή συμβολοσειράς με μονάδα μέτρησης

    return V;    // επέστρεψε το αποτέλεσμα
}
// συνάρτηση υπολογισμού της αντίστασης με γνωστά την τάση και το ρεύμα 
function Ohms_R(V,I,units) {
    // δήλωσε μία μεταβλητή που θα κρατά την τιμή της αντίστασης
    let R = 0;
    // άν η παράμετρος I δέν έχει την τιμή 0
    if (I != 0)
        R = V/I;  // υπολόγισε την αντίσταση απο τις παραμέτρους

    // άν πρέπει να εμφανίσουμε μονάδες μέτρησης στο αποτέλεσμα 
    if (units == true)
        R = R + " Ω"; // μορφοποίησε το αποτέλεσμα σε μορφή συμβολοσειράς με μονάδα μέτρησης
    
    return R;  // επέστρεψε την τιμή της αντίστασης
}